In [8]:
import pandas as pd
import numpy as np
missing=np.nan
data={'year':[1990,1995,2000,2005,2010,2015],
      'schools':[5000,8000,15000,23000,35000,55000],
      'students':[500000,700000,700000,700000,700000,2500000],
      'pass percentage':[45,50,60,65,70,80]}

In [9]:
imdb=pd.DataFrame(data,columns=['year','schools','students','pass percentage'])

imdb.ix[2:4,3]=missing

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [10]:
imdb

   year  schools  students  pass percentage
0  1990     5000    500000             45.0
1  1995     8000    700000             50.0
2  2000    15000    700000              NaN
3  2005    23000    700000              NaN
4  2010    35000    700000              NaN
5  2015    55000   2500000             80.0

In [6]:
imdb.fillna({'students':44,'pass percentage':333})

   year  schools   students  pass percentage
0  1990     5000   500000.0             45.0
1  1995     8000   700000.0             50.0
2  2000    15000  1000000.0            333.0
3  2005    23000       44.0            333.0
4  2010    35000  1800000.0            333.0
5  2015    55000  2500000.0             80.0

In [36]:
imdb<333

    year  schools  students  pass percentage
0  False    False     False             True
1  False    False     False             True
2  False    False     False            False
3  False    False     False            False
4  False    False     False            False
5  False    False     False             True

In [7]:
imdb['pass percentage']>

SyntaxError: invalid syntax (<ipython-input-7-cae6ba92a672>, line 1)

In [39]:
imdb['schools']<6000

0     True
1    False
2    False
3    False
4    False
5    False
Name: schools, dtype: bool

In [ ]:
imdb.dropna(how='all')

In [41]:
imdb.dropna()

   year  schools   students  pass percentage
0  1990     5000   500000.0             45.0
1  1995     8000   700000.0             50.0
5  2015    55000  2500000.0             80.0

In [14]:
imdb.duplicated['students']()

TypeError: 'method' object is not subscriptable

In [12]:
imdb

   year  schools  students  pass percentage
0  1990     5000    500000             45.0
1  1995     8000    700000             50.0
2  2000    15000    700000              NaN
3  2005    23000    700000              NaN
4  2010    35000    700000              NaN
5  2015    55000   2500000             80.0